<?php
require('simple_html_dom.php');
header('Access-Control-Allow-Origin: *');
header("Content-type: text/html; charset=UTF-8");

function transliterateString($txt) {
    $transliterationTable = array('Ã¡' => 'a', 'Ã' => 'A', 'Ã ' => 'a', 'Ã€' => 'A', 'Äƒ' => 'a', 'Ä‚' => 'A', 'Ã¢' => 'a', 'Ã‚' => 'A', 'Ã¥' => 'a', 'Ã…' => 'A', 'Ã£' => 'a', 'Ãƒ' => 'A', 'Ä…' => 'a', 'Ä„' => 'A', 'Ä' => 'a', 'Ä€' => 'A', 'Ã¤' => 'ae', 'Ã„' => 'AE', 'Ã¦' => 'ae', 'Ã†' => 'AE', 'á¸ƒ' => 'b', 'á¸‚' => 'B', 'Ä‡' => 'c', 'Ä†' => 'C', 'Ä‰' => 'c', 'Äˆ' => 'C', 'Ä' => 'c', 'ÄŒ' => 'C', 'Ä‹' => 'c', 'ÄŠ' => 'C', 'Ã§' => 'c', 'Ã‡' => 'C', 'Ä' => 'd', 'ÄŽ' => 'D', 'á¸‹' => 'd', 'á¸Š' => 'D', 'Ä‘' => 'd', 'Ä' => 'D', 'Ã°' => 'dh', 'Ã' => 'Dh', 'Ã©' => 'e', 'Ã‰' => 'E', 'Ã¨' => 'e', 'Ãˆ' => 'E', 'Ä•' => 'e', 'Ä”' => 'E', 'Ãª' => 'e', 'ÃŠ' => 'E', 'Ä›' => 'e', 'Äš' => 'E', 'Ã«' => 'e', 'Ã‹' => 'E', 'Ä—' => 'e', 'Ä–' => 'E', 'Ä™' => 'e', 'Ä˜' => 'E', 'Ä“' => 'e', 'Ä’' => 'E', 'á¸Ÿ' => 'f', 'á¸ž' => 'F', 'Æ’' => 'f', 'Æ‘' => 'F', 'ÄŸ' => 'g', 'Äž' => 'G', 'Ä' => 'g', 'Äœ' => 'G', 'Ä¡' => 'g', 'Ä ' => 'G', 'Ä£' => 'g', 'Ä¢' => 'G', 'Ä¥' => 'h', 'Ä¤' => 'H', 'Ä§' => 'h', 'Ä¦' => 'H', 'Ã­' => 'i', 'Ã' => 'I', 'Ã¬' => 'i', 'ÃŒ' => 'I', 'Ã®' => 'i', 'ÃŽ' => 'I', 'Ã¯' => 'i', 'Ã' => 'I', 'Ä©' => 'i', 'Ä¨' => 'I', 'Ä¯' => 'i', 'Ä®' => 'I', 'Ä«' => 'i', 'Äª' => 'I', 'Äµ' => 'j', 'Ä´' => 'J', 'Ä·' => 'k', 'Ä¶' => 'K', 'Äº' => 'l', 'Ä¹' => 'L', 'Ä¾' => 'l', 'Ä½' => 'L', 'Ä¼' => 'l', 'Ä»' => 'L', 'Å‚' => 'l', 'Å' => 'L', 'á¹' => 'm', 'á¹€' => 'M', 'Å„' => 'n', 'Åƒ' => 'N', 'Åˆ' => 'n', 'Å‡' => 'N', 'Ã±' => 'n', 'Ã‘' => 'N', 'Å†' => 'n', 'Å…' => 'N', 'Ã³' => 'o', 'Ã“' => 'O', 'Ã²' => 'o', 'Ã’' => 'O', 'Ã´' => 'o', 'Ã”' => 'O', 'Å‘' => 'o', 'Å' => 'O', 'Ãµ' => 'o', 'Ã•' => 'O', 'Ã¸' => 'oe', 'Ã˜' => 'OE', 'Å' => 'o', 'ÅŒ' => 'O', 'Æ¡' => 'o', 'Æ ' => 'O', 'Ã¶' => 'oe', 'Ã–' => 'OE', 'á¹—' => 'p', 'á¹–' => 'P', 'Å•' => 'r', 'Å”' => 'R', 'Å™' => 'r', 'Å˜' => 'R', 'Å—' => 'r', 'Å–' => 'R', 'Å›' => 's', 'Åš' => 'S', 'Å' => 's', 'Åœ' => 'S', 'Å¡' => 's', 'Å ' => 'S', 'á¹¡' => 's', 'á¹ ' => 'S', 'ÅŸ' => 's', 'Åž' => 'S', 'È™' => 's', 'È˜' => 'S', 'ÃŸ' => 'SS', 'Å¥' => 't', 'Å¤' => 'T', 'á¹«' => 't', 'á¹ª' => 'T', 'Å£' => 't', 'Å¢' => 'T', 'È›' => 't', 'Èš' => 'T', 'Å§' => 't', 'Å¦' => 'T', 'Ãº' => 'u', 'Ãš' => 'U', 'Ã¹' => 'u', 'Ã™' => 'U', 'Å­' => 'u', 'Å¬' => 'U', 'Ã»' => 'u', 'Ã›' => 'U', 'Å¯' => 'u', 'Å®' => 'U', 'Å±' => 'u', 'Å°' => 'U', 'Å©' => 'u', 'Å¨' => 'U', 'Å³' => 'u', 'Å²' => 'U', 'Å«' => 'u', 'Åª' => 'U', 'Æ°' => 'u', 'Æ¯' => 'U', 'Ã¼' => 'ue', 'Ãœ' => 'UE', 'áºƒ' => 'w', 'áº‚' => 'W', 'áº' => 'w', 'áº€' => 'W', 'Åµ' => 'w', 'Å´' => 'W', 'áº…' => 'w', 'áº„' => 'W', 'Ã½' => 'y', 'Ã' => 'Y', 'á»³' => 'y', 'á»²' => 'Y', 'Å·' => 'y', 'Å¶' => 'Y', 'Ã¿' => 'y', 'Å¸' => 'Y', 'Åº' => 'z', 'Å¹' => 'Z', 'Å¾' => 'z', 'Å½' => 'Z', 'Å¼' => 'z', 'Å»' => 'Z', 'Ã¾' => 'th', 'Ãž' => 'Th', 'Âµ' => 'u', 'Ð°' => 'a', 'Ð' => 'a', 'Ð±' => 'b', 'Ð‘' => 'b', 'Ð²' => 'v', 'Ð’' => 'v', 'Ð³' => 'g', 'Ð“' => 'g', 'Ð´' => 'd', 'Ð”' => 'd', 'Ðµ' => 'e', 'Ð•' => 'e', 'Ñ‘' => 'e', 'Ð' => 'e', 'Ð¶' => 'zh', 'Ð–' => 'zh', 'Ð·' => 'z', 'Ð—' => 'z', 'Ð¸' => 'i', 'Ð˜' => 'i', 'Ð¹' => 'j', 'Ð™' => 'j', 'Ðº' => 'k', 'Ðš' => 'k', 'Ð»' => 'l', 'Ð›' => 'l', 'Ð¼' => 'm', 'Ðœ' => 'm', 'Ð½' => 'n', 'Ð' => 'n', 'Ð¾' => 'o', 'Ðž' => 'o', 'Ð¿' => 'p', 'ÐŸ' => 'p', 'Ñ€' => 'r', 'Ð ' => 'r', 'Ñ' => 's', 'Ð¡' => 's', 'Ñ‚' => 't', 'Ð¢' => 't', 'Ñƒ' => 'u', 'Ð£' => 'u', 'Ñ„' => 'f', 'Ð¤' => 'f', 'Ñ…' => 'h', 'Ð¥' => 'h', 'Ñ†' => 'c', 'Ð¦' => 'c', 'Ñ‡' => 'ch', 'Ð§' => 'ch', 'Ñˆ' => 'sh', 'Ð¨' => 'sh', 'Ñ‰' => 'sch', 'Ð©' => 'sch', 'ÑŠ' => '', 'Ðª' => '', 'Ñ‹' => 'y', 'Ð«' => 'y', 'ÑŒ' => '', 'Ð¬' => '', 'Ñ' => 'e', 'Ð­' => 'e', 'ÑŽ' => 'ju', 'Ð®' => 'ju', 'Ñ' => 'ja', 'Ð¯' => 'ja');
    $txt = str_replace(array_keys($transliterationTable), array_values($transliterationTable), $txt);
    return $txt;
}

$entrada = array();

$html=file_get_html('http://www.nutricao.ufrj.br/cardapio.htm');

$cnt = 0;
$ind = 0;
$ref = 0;
$total_row = 0;

foreach($html->find('tr') as $row) {
     $total_row++; 
}

$start_offset = $total_row-16;

foreach($html->find('tr') as $row) {
    $cnt++;
    if ($cnt>=$start_offset && $cnt!=($start_offset+6) && $cnt!=($start_offset+7) 
          && $cnt!=($start_offset+8) && $ref<2){
    	$entrada[$ref][$ind][0] = $row->find('td',1)->plaintext;
    	$entrada[$ref][$ind][1] = $row->find('td',2)->plaintext;
    	$entrada[$ref][$ind][2] = $row->find('td',3)->plaintext;
	$entrada[$ref][$ind][3] = $row->find('td',4)->plaintext;
	$entrada[$ref][$ind][4] = $row->find('td',5)->plaintext;
	$entrada[$ref][$ind][5] = $row->find('td',6)->plaintext;
	$entrada[$ref][$ind][6] = $row->find('td',7)->plaintext;
        $ind++;
        if ($cnt==($start_offset+5) ||$cnt==($start_offset+14)){ $ref++;
	    $ind=0;
	}
    }
    if ( $ref>=2){ 
       break; 
     }
}

file_put_contents("BDCardapio.txt", "");

for ($i = 0; $i < 7; $i++){
   for ($j =0; $j < 2; $j++){
	for ($k=0; $k < 6; $k++){
            $aux = transliterateString($entrada[$j][$k][$i]);
            $aux = preg_replace('!\s+!', ' ', $aux);
            file_put_contents("BDCardapio.txt", $aux. "\n", FILE_APPEND);
        } 
   }

}

$id = file("UpdateID.txt");

$id[0] = $id[0]+1;

file_put_contents("UpdateID.txt", $id[0]."\n");
echo "success";

?>